Tekla Open API Reference for Tekla Structures 2025
MarkSet.Attributes Property
 Gets or sets the mark set attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public MarkSet.MarkSetAttributes Attributes { get; set; }
Public Property Attributes As MarkSet.MarkSetAttributes
	Get
	Set
Property Value
Type: MarkSet.MarkSetAttributes
See Also
Reference
MarkSet Class
Tekla.Structures.Drawing Namespace